app/views/quizzes/_form.html.erb

SELECT "institutions".* FROM "institutions"  ORDER BY "institutions"."nome" ASC
---
    <%= label_tag :Instituição %><br>
    <%= collection_select(nil, :institution_id, Institution.order(:nome), :id, :nome) %>

SELECT "campus".* FROM "campus"  ORDER BY "campus"."nome" ASC
---
    <%= label_tag :Campus %><br>
    <%= grouped_collection_select(nil, :campu_id, Institution.order(:nome), :campus, :nome, :id, :name)%>

SELECT "campus".* FROM "campus"  ORDER BY "campus"."name" ASC
---
    <%= label_tag :Centro %><br>
    <%= grouped_collection_select(nil, :center_id, Campu.order(:name), :centers, :name, :id, :name)%>