app/views/coordinators/_form.html.erb

SELECT "institutions".* FROM "institutions"  ORDER BY "institutions"."nome" ASC
---
    <%= label_tag :institution %><br>
    <%= f.collection_select :institution_id, Institution.order(:nome), :id, :nome, include_blank: true%>