app/views/subjects/show.html.erb

        <tbody>
          <% @subject.classrooms.each do |classroom| %>
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."subject_id" = $1  [["subject_id", 1]]