app/controllers/administrators_controller.rb

  def index
    @administrators = User.where(type: 'Administrator').find_each
---
SELECT  "users".* FROM "users" WHERE "users"."type" = $1  ORDER BY "users"."id" ASC LIMIT 1000  [["type", "Administrator"]]

    def set_administrator
      @administrator = Administrator.find(params[:id])
---
SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT 1  [["id", 1]]