app/controllers/admin_controller.rb

  def index
    @pendings_students = User.where(type: 'Student', approved: false).find_each
    @pendings = User.where(approved: false).find_each
---
SELECT  "users".* FROM "users" WHERE "users"."type" = $1 AND "users"."approved" = $2  ORDER BY "users"."id" ASC LIMIT 1000  [["type", "Student"], ["approved", "f"]]
SELECT  "users".* FROM "users" WHERE "users"."approved" = $1  ORDER BY "users"."id" ASC LIMIT 1000  [["approved", "f"]]

  def aprove
   @pending = User.where(id: params[:pending]).first
    @pending.approved = true
    @pending.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "approved" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["approved", "t"], ["updated_at", "2016-05-25 19:00:48.721328"], ["id", 1]]