app/controllers/anchors_controller.rb

SELECT "anchors".* FROM "anchors"
---
  def index
    @anchors = Anchor.all

INSERT INTO "anchors" ("nome", "descricao", "perfil", "perspectiva", "tipo", "anchorinfo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["nome", ""], ["descricao", ""], ["perfil", ""], ["perspectiva", ""], ["tipo", ""], ["anchorinfo_id", 1], ["created_at", "2016-06-08 19:04:09.168932"], ["updated_at", "2016-06-08 19:04:09.168932"]]
---
  def create
    @anchor = Anchor.new(anchor_params)

    respond_to do |format|
      if @anchor.save

SELECT  "anchors".* FROM "anchors" WHERE "anchors"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_anchor
      @anchor = Anchor.find(params[:id])