app/controllers/campus_controller.rb

SELECT "campus".* FROM "campus"
---
  def index
    if current_user.type == "Administrator"
      @campus = Campu.all

INSERT INTO "campus" ("name", "institution_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "campus-central"], ["institution_id", 1], ["created_at", "2016-06-06 17:23:57.478562"], ["updated_at", "2016-06-06 17:23:57.478562"]]
---
  def create
    @campu = Campu.new(campu_params)

    respond_to do |format|
      if @campu.save

SELECT  "campus".* FROM "campus" WHERE "campus"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_campu
      @campu = Campu.find(params[:id])