app/controllers/centers_controller.rb

SELECT "centers".* FROM "centers"
---
  def index
    @centers = Center.all

INSERT INTO "centers" ("name", "campu_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "diatinf"], ["campu_id", 1], ["created_at", "2016-06-06 17:33:52.727805"], ["updated_at", "2016-06-06 17:33:52.727805"]]
---
  def create
    @center = Center.new(center_params)

    respond_to do |format|
      if @center.save

SELECT  "centers".* FROM "centers" WHERE "centers"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_center
      @center = Center.find(params[:id])