app/controllers/classrooms_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."nome" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["nome", "renato"]]
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]
---
  def add_user
    @user = User.where(nome: params[:user_id]).first
    @classroom = Classroom.find(params[:classroom_id])

INSERT INTO "classrooms" ("subject_id", "turno", "codigo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["subject_id", 1], ["turno", "matutino"], ["codigo", "12345"], ["created_at", "2016-05-25 18:58:45.338391"], ["updated_at", "2016-05-25 18:58:45.338391"]]
---
  def create
    @classroom = Classroom.new(classroom_params)

    respond_to do |format|
      if @classroom.save

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_classroom
      @classroom = Classroom.find(params[:id])