app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (nome ilike '%t%')  ORDER BY "courses"."nome" ASC
---
  def search
      @courses = Course.order(:nome).where("nome ilike ?", "%#{params[:term]}%")

INSERT INTO "courses" ("nome", "turno", "institution_id", "data_abertura", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "TADS"], ["turno", "matutino"], ["institution_id", 1], ["data_abertura", "2016-05-25"], ["created_at", "2016-05-25 18:55:18.348477"], ["updated_at", "2016-05-25 18:55:18.348477"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save