app/controllers/institutions_controller.rb

  def index
    @institutions = Institution.all
---
SELECT "institutions".* FROM "institutions"

  def search
      @institutions = Institution.order(:nome).where("nome ilike ?", "%#{params[:term]}%")
---
SELECT "institutions".* FROM "institutions" WHERE (nome ilike '%i%')  ORDER BY "institutions"."nome" ASC

  def create
    @institution = Institution.new(institution_params)

    respond_to do |format|
      if @institution.save
---
INSERT INTO "institutions" ("nome", "cnpj", "logradouro", "numero", "bairro", "cep", "cidade", "estado", "tel", "organizacao_academica", "categoria_administrativa", "site", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

    def set_institution
      @institution = Institution.find(params[:id])
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = $1 LIMIT 1  [["id", 1]]