app/controllers/results_controller.rb

INSERT INTO "results" ("student_id", "data_final", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["data_final", "2016-06-08"], ["created_at", "2016-06-08 18:23:04.928376"], ["updated_at", "2016-06-08 18:23:04.928376"]]
---
  def create
    @result = Result.new(result_params)

    respond_to do |format|
      if @result.save

DELETE FROM "results" WHERE "results"."id" = $1  [["id", 5]]
---
  def destroy
    @result.destroy

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_result
      @result = Result.find(params[:id])