app/controllers/subjects_controller.rb

  def search
      @subjects = Subject.order(:nome).where("nome ilike ?", "%#{params[:term]}%")
---
SELECT "subjects".* FROM "subjects" WHERE (nome ilike '%tu%')  ORDER BY "subjects"."nome" ASC

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("nome", "ch", "ementa", "codigo", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"